public class additional7 {
    public static void main(String[] args) {
        int sum = 0;
        for (int i = 1; i <= 100; i += 2) {
            sum += i;
        }
        System.out.println(" The sum of odd values equal to " + sum);
    }
}


//7)Напишите программу, определяющую сумму всех нечетных чисел от 1до 99