import java.util.Arrays;

public class additional6 {
    public static void main(String[] args) {
        int i;
        for (i = 1; i <= 100; i++) {
            if (i % 2 == 0)
                System.out.println(i);
        }
    }
}
//6)Напишите программу вывода всех четных чисел от 2 до 100 включительно