package src;

import java.util.Arrays;

public class additional6 {
    public static void main(String[] args) {
        for (int i = 0; i <= 100; i += 2) {
            if (i > 0)
                System.out.println(i);
        }
    }
}
//6)Напишите программу вывода всех четных чисел от 2 до 100 включительно